[
  {
    "title": "Shadows of Twilight",
    "type": "Video Game",
    "startDate": "2018-11-28",
    "endDateIsPresent": true,
    "description": "Shadows of Twilight is a hobby video game I am working on. It is being designed with Unity, ASP.NET, Blazor, and Kubernetes. This is a private project, due to this; source code is not available."
  },
  {
    "title": "Chroma Control",
    "type": "Razer Synapse Extension",
    "startDate": "2019-11-26",
    "endDateIsPresent": true,
    "description": "Chroma Control is a set of modules that can be installed onto a PC using Razer Synapse to allow you to control hardware from 3rd parties. This project uses .NET Core 3.0, ASP.NET worker services, and RGBKit. The goal was to keep this project simple and utalize RGBKit for most of the heavy work.",
    "url": "https://github.com/ChromaControl/ChromaControl"
  },
  {
    "title": "RGBKit",
    "type": "Computer Lighting SDK",
    "startDate": "2019-10-14",
    "endDateIsPresent": true,
    "description": "RGBKit is a PC RGB SDK that allows you to control multiple ecosystems of hardware from one unified and easy to use SDK. It is made in .NET Standard 2.1 so as to keep it available for use in the majority of .NET at this time.",
    "url": "https://github.com/RGBKit/rgbkit"
  },
  {
    "title": "Aura Connect",
    "type": "Razer Synapse Extension",
    "startDate": "2019-09-15",
    "endDateIsPresent": true,
    "description": "Aura connect is a project that set out to allow you to control ASUS Aura devices from Razer Synapse. It uses .NET Core 3.0 and ASP.Net worker services. This project attracted the attention of Razer's CEO Min-Liang Tan with praise for extending the Chroma ecosystem.",
    "url": "https://github.com/AndrewBabbitt97/AuraConnect"
  },
  {
    "title": "Danbooru",
    "type": "Image Board Software",
    "startDate": "2016-10-06",
    "endDate": "2018-05-01",
    "endDateIsPresent": false,
    "description": "Danbooru is a taggable image board. It is written in Ruby on the Rails and PostgreSQL. I helped with debugging issues, and supplying better install scripts.",
    "url": "https://github.com/danbooru/danbooru"
  },
  {
    "title": "Project Meteor Server",
    "type": "Server Emulator",
    "startDate": "2016-03-29",
    "endDate": "2019-04-01",
    "endDateIsPresent": false,
    "description": "Project Meteor Server is a Final Fantasy XIV 1.23b server emulator. It is written in C#, PHP, and MySQL. I contributed bug fixes, documentation, as well as general advice on how to best implement things going forward. Seeing as the game is no longer running, this is an effort to write software so that the game may be playable for others who never got to experience it.",
    "url": "https://bitbucket.org/Ioncannon/project-meteor-server"
  },
  {
    "title": "Mists of Time",
    "type": "Video Game",
    "startDate": "2014-07-01",
    "endDate": "2016-03-01",
    "endDateIsPresent": false,
    "description": "Mists of Time was a game I started working on in High School. This was definitely a time where i was learning more about game dev, as such the code is pretty sparse and stripped down on my Github. I keep this up mostly as a reference of what NOT to do.",
    "url": "https://github.com/AndrewBabbitt97?tab=repositories&q=mot"
  },
  {
    "title": "Project Darkstar",
    "type": "Server Emulator",
    "startDate": "2013-10-01",
    "endDate": "2014-02-01",
    "endDateIsPresent": false,
    "description": "Project Darkstar is a Final Fantasy XI server emulator. It is written in C++ and uses MySQL for a backend data store. I have contributed documentation and code to progress this project so that someday it may be usable if Square Enix ever decides to take down the official servers.",
    "url": "https://github.com/DarkstarProject/darkstar"
  },
  {
    "title": "Dirty Unicorns",
    "type": "Android Fork",
    "startDate": "2013-03-01",
    "endDate": "2016-06-01",
    "endDateIsPresent": false,
    "description": "Dirty Unicorns is a fork of AOSP (Android Open Source Project). This is a distribution of Android that has been around for a very long time, the languages and tools used are very extensive. I helped in debugging and tracking issues, on occasion submitting code to fix issues when i found any. For a while I helped the community by providing weekly builds out of a Jenkins instance hosted in Azure.",
    "url": "https://dirtyunicorns.com/"
  }
]
